# pandas

* "pandas is a Python package **providing fast, flexible, and expressive data structures** designed to make working with 'relational' or 'labeled' data both easy and intuitive."
* "built on top of NumPy"
* "It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python."
* "pandas is well suited for many different kinds of data:
  * **Tabular data with heterogeneously-typed columns**, as in an SQL table or Excel spreadsheet
  * Ordered and unordered (not necessarily fixed-frequency) **time series data**.
  * Arbitrary **matrix data** (homogeneously typed or heterogeneous) with row and column labels
  * Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure"
* Primary **data structures**:
  * **Series** (1-dimensional)
  * **DataFrame** (2-dimensional)

https://pandas.pydata.org/pandas-docs/stable/getting_started/overview.html

In [1]:
import pandas as pd
import numpy as np

# Series

`class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)`[[source](https://github.com/pandas-dev/pandas/blob/v0.24.2/pandas/core/series.py#L102-L4383)]

* "One-dimensional `ndarray` with axis labels (including time series)"
* Like a column in a spreadsheet
* "The axis labels are collectively referred to as the **index**"
* "capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.)"
* All elements in a `Series` have the same data type

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#series

In [2]:
pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [3]:
# creating a Series using a dict
d = {'a': 0., 'b': 1., 'c': 2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [4]:
# creating a Series from a dict but in a specified order
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

"NaN (not a number) is the standard missing data marker used in pandas"

In [5]:
# creating Series using a scalar value. The length of the index is matched 
# with a repeated value
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## Series is array-like
https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#series-is-ndarray-like

In [6]:
s = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
s

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [7]:
s['a']

0.25

In [8]:
# select value at position
s[0]

0.25

In [9]:
# slice Series
s[:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [10]:
# select elements with a list of positional numbers (array-based indexing)
s[[ 3, 1]]

d    1.0
b    0.5
dtype: float64

In [11]:
# converting the Series to a pandas array (ExtensionArray) without the index
s.values

array([0.25, 0.5 , 0.75, 1.  ])

## Series is dict-like
https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#series-is-dict-like

In [12]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [13]:
# select value at index (label)
population['California']

38332521

In [14]:
# change value at index
population['Texas'] = 26448193 +2
population

California    38332521
Texas         26448195
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## Vectorized operations and label alignment with Series
https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#vectorized-operations-and-label-alignment-with-series

In [15]:
s = pd.Series(range(5),index=(['a', 'b', 'c', 'd', 'e']))

In [16]:
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [17]:
# addition
s+s

a    0
b    2
c    4
d    6
e    8
dtype: int64

In [18]:
# multiplication
s*3

a     0
b     3
c     6
d     9
e    12
dtype: int64

In [19]:
np.exp(s)

a     1.000000
b     2.718282
c     7.389056
d    20.085537
e    54.598150
dtype: float64

In [20]:
s[1:]

b    1
c    2
d    3
e    4
dtype: int64

In [21]:
s[:-1]

a    0
b    1
c    2
d    3
dtype: int64

In [22]:
# operations between Series automatically align the data based on index (label)
s[1:] + s[:-1]

a    NaN
b    2.0
c    4.0
d    6.0
e    NaN
dtype: float64

# DataFrame

`class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)` [[source](http://github.com/pandas-dev/pandas/blob/v0.24.2/pandas/core/frame.py#L290-L7950)]

* Primary data structure in pandas
* 2D tabular data structure
* Labeled rows and columns (axes)
* Potentially heterogeneous data (different data types)
* Mutable size
* "dict-like container for Series objects" (similar to a spreadsheet)

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html and https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#dataframe

### DataFrame as a generalized NumPy array
If a ``Series`` is an analog of a one-dimensional array with flexible indices, a ``DataFrame`` is an analog of a two-dimensional array with both flexible row indices and flexible column names.
Just as you might think of a two-dimensional array as an ordered sequence of aligned one-dimensional columns, you can think of a ``DataFrame`` as a sequence of aligned ``Series`` objects.
Here, by "aligned" we mean that they share the same index.

To demonstrate this, let's first construct a new ``Series`` listing the area of each of the five states discussed in the previous section:

In [23]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

Now that we have this along with the ``population`` Series from before, we can use a dictionary to construct a single two-dimensional object containing this information:

In [24]:
df = pd.DataFrame({'population': population,
                       'area': area})
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Like the ``Series`` object, the ``DataFrame`` has an ``index`` attribute that gives access to the index labels:

In [25]:
df.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Additionally, the ``DataFrame`` has a ``columns`` attribute, which is an ``Index`` object holding the column labels:

In [26]:
df.columns

Index(['population', 'area'], dtype='object')

Thus the ``DataFrame`` can be thought of as a generalization of a two-dimensional NumPy array, where both the rows and columns have a generalized index for accessing the data.

### DataFrame as specialized dictionary

In [27]:
df['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

## Basic methods and attributes on a DataFrame
https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#minutes-to-pandas

In [28]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [29]:
# view the dimensionality of the DataFrame: (rows, columns)
df.shape

(5, 2)

In [30]:
# get the data types of the columns (Series) in the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, California to Illinois
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  5 non-null      int64
 1   area        5 non-null      int64
dtypes: int64(2)
memory usage: 280.0+ bytes

In [31]:
# get the first x rows of the DataFrame
df.head(2)

            population    area
California    38332521  423967
Texas         26448195  695662

In [32]:
# get the last x rows of the DataFrame
df.tail(1)

          population    area
Illinois    12882135  149995

In [33]:
# get some basic statistics of the DataFrame
df.describe()

         population           area
count  5.000000e+00       5.000000
mean   2.337337e+07  316246.600000
std    9.640386e+06  242437.411951
min    1.288214e+07  141297.000000
25%    1.955286e+07  149995.000000
50%    1.965113e+07  170312.000000
75%    2.644820e+07  423967.000000
max    3.833252e+07  695662.000000

In [34]:
# transpose the DataFrame
df.T

            California     Texas  New York   Florida  Illinois
population    38332521  26448195  19651127  19552860  12882135
area            423967    695662    141297    170312    149995

In [35]:
# get a NumPy representation of the DataFrame
df.values

array([[38332521,   423967],
       [26448195,   695662],
       [19651127,   141297],
       [19552860,   170312],
       [12882135,   149995]])

### The ```index``` and ```columns``` attributes

In [36]:
# get the indices of the DataFrame
df.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [37]:
df.columns

Index(['population', 'area'], dtype='object')

## Creating an empty DataFrame

In [38]:
# create an empty DataFrame
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [39]:
# use the .empty attribute to check if a dataFrane is empty
pd.DataFrame().empty

True

In [40]:
# create an empty DataFrame with 5 rows and 3 columns
pd.DataFrame(index=np.arange(5), columns=['A', 'B', 'C'])

     A    B    C
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN
4  NaN  NaN  NaN

# Data Selection

In [41]:

df['population']

California    38332521
Texas         26448195
New York      19651127
Florida       19552860
Illinois      12882135
Name: population, dtype: int64

### Select DataFrame columns
#### using ```[]```

In [42]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [43]:
# select a Series (single column) of a DataFrame
df['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [44]:
# select multiple columns of a DataFrame
df[['population',"area"]]

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

#### Select rows and columns using the ```df.loc['label']``` and the ```df.iloc[loc]``` methods

#### Select rows and columns using label based indexing

```DataFrame.loc```

"Access a group of rows and columns by label(s) or a boolean array.

```loc[]``` is primarily label based, but may also be used with a boolean array."

"Integers are valid labels, but they refer to the label and not the position".

"The following are valid inputs:

* A single label, e.g. 5 or 'a' (Note that 5 is interpreted as a label of the index. This use is not an integer position along the index.).
* A list or array of labels ['a', 'b', 'c'].
* A slice object with labels 'a':'f' (Note that contrary to usual python slices, both the **start and the stop are included**, when present in the index! See [Slicing with labels](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-slicing-with-labels).).
* A boolean array.
* A callable, see [Selection By Callable](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-callable)."

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html and https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#selection-by-label

##### Select rows using ```loc```

In [45]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [46]:
# select row by index label
df.loc['New York']

population    19651127
area            141297
Name: New York, dtype: int64

In [47]:
# select rows by starting index label
df.loc['New York':]

          population    area
New York    19651127  141297
Florida     19552860  170312
Illinois    12882135  149995

In [48]:
# select rows by ending index label (inclusive end!)
df.loc[:'New York']

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297

In [49]:
# select rows by starting and ending index label (inclusive end!)
df.loc['New York':'Florida']

          population    area
New York    19651127  141297
Florida     19552860  170312

##### Select columns using ```loc```

In [50]:
# select columns until 'two' (inclusive end!)
df.loc[:, :'area']

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [51]:
# select a single column
df.loc[:, 'area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

##### Select rows and columns using```loc```

In [52]:
# select rows (until 'c' inclusive!) and 
# columns (starting from 'two')
df.loc[:'New York', 'area']

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

In [53]:
# select single row and single column
df.loc['New York', 'area']

141297

#### Select rows and columns by position

```DataFrame.iloc```

"**Purely integer-location based indexing** for selection by position.

```iloc[]``` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array."

* "The semantics follow closely Python and NumPy slicing" (0-based indexing)
* "When slicing, the **start bounds is *included*, while the upper bound is *excluded***"
* "Trying to use a non-integer, even a valid label will raise an ```IndexError```"

"The ```iloc``` attribute is the primary access method. The following are valid inputs:
* An integer e.g. 5.
* A list or array of integers [4, 3, 0].
* A slice object with ints 1:7.
* A boolean array.
* A callable, see [Selection By Callable](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-callable)."

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html and
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#selection-by-position

In [54]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

##### Select rows using ```iloc```

In [55]:
# select row by integer location of the index
df.iloc[2]

population    19651127
area            141297
Name: New York, dtype: int64

In [56]:
# select rows by starting index integer
df.iloc[2:]

          population    area
New York    19651127  141297
Florida     19552860  170312
Illinois    12882135  149995

In [57]:
# select rows by ending index integer (exclusive)
df.iloc[:2]

            population    area
California    38332521  423967
Texas         26448195  695662

##### Select columns using ```iloc```

In [58]:
# select second column (zero-based)
df.iloc[:, 1]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [59]:
# select columns starting from the second index
df.iloc[:, 1:]

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [60]:
# select columns until third index (exclusive)
df.iloc[:, :2]

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

##### Select rows and columns using```iloc```

In [61]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [62]:
# select single value from the second row ('b') and 
# the third column ('three', note: zero-based index selection)
df.iloc[1, 0]

26448195

In [63]:
# select rows and columns by position via integer slicing
# select the first four rows and the second column (exclusive end)
df.iloc[0:5, 1:3]

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [64]:
# mixing ranges and single selections is possible:
# select the second and third row and the third column (zero-based)
df.iloc[1:3, 1]

Texas       695662
New York    141297
Name: area, dtype: int64

### ```[]``` vs. ```.loc[]``` vs. ```.iloc[]```
For a DataFrame with uppercase letters as column labels ('A', 'B', 'C') and lowercase letters as row labels ('a', 'b', 'c', 'd') the following operations can be applied for selecting or slicing rows or columns (this table shows when exchanging the ```[]``` method with ```loc``` or ```iloc``` returns the same result):

| Operatation                        | ```[]``` method      | ```loc``` method | ```iloc``` method |
|:-----------------------------------|:---------------------|:-----------------|:------------------|
| Select a single column by label    | ```df['A']```        | ```df.loc[:, 'A']```        | -      |
| Select list of columns by label    | ```df[['A', 'C']]``` | ```df.loc[:, ['A', 'C']]``` | -      |
| Slice columns by label             | -                    | ```df.loc[:, 'A':'C']```    |        |
| Select a single column by position | -                    | -                           | ```df.iloc[:, 1]``` |
| Select list of columns by position | -                    | -                           | ```df.iloc[:, [0, 2]]``` |
| Slice columns by position          | -                    | -                           | ```df.iloc[:, 0:2]``` |
| Select a single row by label       | -                    | ```df.loc['b']```           | - |
| Select a list of rows by label     | -                    | ```df.loc[['b', 'd']]```    | - |
| Slice rows by label                | ```df['b':'d']```*   | ```df.loc['b':'d']```*      | - | 
| Select a single row by position    | -                    | -                           | ```df.iloc[1]```|
| Select a list of rows by position  | -                    | -                           | ```df.iloc[[1, 3]]``` |
| Slice rows by position             | ```df[1:4]```        | -                           | ```df.iloc[1:4]``` | 


\* inclusive end of the selection


Note that you could also combine the selection of rows and columns (for the ```loc``` and ```iloc``` methods but not the ```[]``` method).

Pay attention when assigning values to selections. **Always use ```loc``` or ```iloc``` to be guaranteed to modify the original DataFrame**.

https://stackoverflow.com/a/48411543/6270819 and https://stackoverflow.com/a/47098873/6270819

### Select random samples

```DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None)```

"Return a random sample of items from an axis of object. You can use *random_state* for reproducibility.

**Parameters:**
* **n:** *int, optional*. Number of items from axis to return. Cannot be used with *frac*. Default ```= 1``` if ```frac = None```.
* **fra:** *float, optional*. Fraction of axis items to return. Cannot be used with *n*.
* **replace:** *bool, default ```False```*. Sample with or without replacement.
* **weights:** *str or ndarray-like, optional*. Default ```None``` results in equal probability weighting. If passed a Series, will align with target object on index. Index values in weights not found in sampled object will be ignored and index values in sampled object not in weights will be assigned weights of zero. If called on a DataFrame, will accept the name of a column when ```axis = 0```. Unless weights are a Series, weights must be same length as axis being sampled. If weights do not sum to 1, they will be normalized to sum to 1. Missing values in the weights column will be treated as zero. Infinite values not allowed.
* **random_state:** *int or ```numpy.random.RandomState```, optional*. Seed for the random number generator (if int), or numpy RandomState object.
* **axis:** *int or string, optional*. Axis to sample. Accepts axis number or name. Default is stat axis for given data type (0 for Series and DataFrames, 1 for Panels).

**Returns: Series or DataFrame:** A new object of same type as caller containing *n* items randomly sampled from the caller object."


https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html

In [65]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [66]:
df.sample(n=3)

            population    area
Texas         26448195  695662
Illinois      12882135  149995
California    38332521  423967

In [67]:
df.sample(frac=.5)

         population    area
Texas      26448195  695662
Florida    19552860  170312

### Modify DataFrame values

#### Modify multiple values with ```loc```
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [68]:
df

            population    area
California    38332521  423967
Texas         26448195  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [69]:
df.loc[['Florida','Texas']] = 0
df

            population    area
California    38332521  423967
Texas                0       0
New York      19651127  141297
Florida              0       0
Illinois      12882135  149995

In [70]:
# Set value for a columns
df.loc[:, 'population'] = 0
df

            population    area
California           0  423967
Texas                0       0
New York             0  141297
Florida              0       0
Illinois             0  149995

In [71]:
df.loc[['California','New York'], 'area'] = 0
df

            population    area
California           0       0
Texas                0       0
New York             0       0
Florida              0       0
Illinois             0  149995

In [72]:
#lets reset
df.loc[:, 'population'] = population_dict.values()
df.loc[:, 'area'] = area_dict.values()
df

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

#### Modify multiple values with ```iloc```
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

The official documentation does only mention the ```loc``` method for setting values. To my experience the ```iloc``` method works just as well but always use ```loc``` when in doubt.

In [73]:
# Set value for an entire row
df.iloc[3] = 1
df

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida              1       1
Illinois      12882135  149995

In [74]:
 # Set value for an entire column
df.iloc[:, 0] = 0
df

            population    area
California           0  423967
Texas                0  695662
New York             0  141297
Florida              0       1
Illinois             0  149995

In [75]:
 # Set value for an entire column
df.iloc[[0,1], 1] = 0
df

            population    area
California           0       0
Texas                0       0
New York             0  141297
Florida              0       1
Illinois             0  149995

In [76]:
#lets reset
df.loc[:, 'population'] = population_dict.values()
df.loc[:, 'area'] = area_dict.values()
df

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

### Inserting Columns

In [77]:
# insert a coloumn using a boolean statement
df['density'] = df['population'] / df['area']

df

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [78]:
# insert a coloumn using a boolean statement
df['high_density'] = df['density']>=100

df

            population    area     density  high_density
California    38332521  423967   90.413926         False
Texas         26448193  695662   38.018740         False
New York      19651127  141297  139.076746          True
Florida       19552860  170312  114.806121          True
Illinois      12882135  149995   85.883763         False

In [79]:
# insert a coloumn using a single value
df['country'] = "USA"

df

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA
New York      19651127  141297  139.076746          True     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA

### Delete Rows and/or Columns with the ```drop``` method

```DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')```

"Drop specified labels from rows or columns.

Remove rows or columns by specifying label names and corresponding axis, or by specifying directly index or column names. When using a multi-index, labels on different levels can be removed by specifying the level.

**Parameters:**
* **labels**: *single label or list-like.* Index or column labels to drop.
* **axis**: *{0 or ‘index’, 1 or ‘columns’}, default 0*. Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).
* **index, columns**: *single label or list-like.* Alternative to specifying axis (labels, axis=1 is equivalent to columns=labels).
* **level**: *int or level name, optional.* For MultiIndex, level from which the labels will be removed.
* **inplace**: *bool, default False.* If True, do operation inplace and return None.
* **errors**: *{‘ignore’, ‘raise’}, default ‘raise’.* If ‘ignore’, suppress error and only existing labels are dropped.

**Returns:** **dropped**: *pandas.DataFrame*"

In [80]:
df

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA
New York      19651127  141297  139.076746          True     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA

In [81]:
# delete column using the del statement
df.drop(columns=['country'])

            population    area     density  high_density
California    38332521  423967   90.413926         False
Texas         26448193  695662   38.018740         False
New York      19651127  141297  139.076746          True
Florida       19552860  170312  114.806121          True
Illinois      12882135  149995   85.883763         False

In [82]:
df

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA
New York      19651127  141297  139.076746          True     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA

In [83]:
# drop multiple columns
df.drop(columns=['country', 'high_density'])

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [84]:
df_short = df.drop(columns=['country'])

In [85]:
df_short

            population    area     density  high_density
California    38332521  423967   90.413926         False
Texas         26448193  695662   38.018740         False
New York      19651127  141297  139.076746          True
Florida       19552860  170312  114.806121          True
Illinois      12882135  149995   85.883763         False

In [86]:
# drop single row
df.drop('California')

          population    area     density  high_density country
Texas       26448193  695662   38.018740         False     USA
New York    19651127  141297  139.076746          True     USA
Florida     19552860  170312  114.806121          True     USA
Illinois    12882135  149995   85.883763         False     USA

In [87]:
# drop single row using 'index' argument for clarity
df.drop(index='California')

          population    area     density  high_density country
Texas       26448193  695662   38.018740         False     USA
New York    19651127  141297  139.076746          True     USA
Florida     19552860  170312  114.806121          True     USA
Illinois    12882135  149995   85.883763         False     USA

In [88]:
# drop multiple rows
df.drop(index=['California', 'Texas'])

          population    area     density  high_density country
New York    19651127  141297  139.076746          True     USA
Florida     19552860  170312  114.806121          True     USA
Illinois    12882135  149995   85.883763         False     USA

In [89]:
# drop rows and columns
df.drop(index='California', columns='country')

          population    area     density  high_density
Texas       26448193  695662   38.018740         False
New York    19651127  141297  139.076746          True
Florida     19552860  170312  114.806121          True
Illinois    12882135  149995   85.883763         False

## Boolean Indexing
Using "boolean vectors to filter the data" and combine multiple conditional expressions with the logical operators ```&``` for **and**, ```|``` for **or**, and ```~``` for **not** ("**must** be grouped using parentheses").

https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#boolean-indexing and http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#boolean-indexing 
and https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#indexing-selection

In [90]:
df

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA
New York      19651127  141297  139.076746          True     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA

In [91]:
# select data using the data of a column
df[df['area']>400000]

            population    area    density  high_density country
California    38332521  423967  90.413926         False     USA
Texas         26448193  695662  38.018740         False     USA

In [92]:
# this is equal to loc. The loc access is much preferred
df.loc[df['area']>400000]

            population    area    density  high_density country
California    38332521  423967  90.413926         False     USA
Texas         26448193  695662  38.018740         False     USA

In [93]:
# use the boolean values in the flag column to select rows
df[df['high_density']]

          population    area     density  high_density country
New York    19651127  141297  139.076746          True     USA
Florida     19552860  170312  114.806121          True     USA

In [94]:
# use a list of booleans to access rows
df.loc[[False, True, True, False,False]]

          population    area     density  high_density country
Texas       26448193  695662   38.018740         False     USA
New York    19651127  141297  139.076746          True     USA

In [95]:
# selecting rows that match a more complex criterion
criterion = df['area'] > 400000
criterion

California     True
Texas          True
New York      False
Florida       False
Illinois      False
Name: area, dtype: bool

In [96]:
df[criterion]

            population    area    density  high_density country
California    38332521  423967  90.413926         False     USA
Texas         26448193  695662  38.018740         False     USA

In [97]:
# multiple criteria
# large numbers can be typed with a 
df[criterion & (df['population'] > 30_000_000)] # and

            population    area    density  high_density country
California    38332521  423967  90.413926         False     USA

In [98]:
# multiple criteria
# large numbers can be typed with a 
df[criterion | (df['population'] > 30_000_000)] # or

            population    area    density  high_density country
California    38332521  423967  90.413926         False     USA
Texas         26448193  695662  38.018740         False     USA

# Sort values and index

In [99]:
df

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA
New York      19651127  141297  139.076746          True     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA

In [100]:
df.sort_index()

            population    area     density  high_density country
California    38332521  423967   90.413926         False     USA
Florida       19552860  170312  114.806121          True     USA
Illinois      12882135  149995   85.883763         False     USA
New York      19651127  141297  139.076746          True     USA
Texas         26448193  695662   38.018740         False     USA

In [101]:
df.sort_values('area')

            population    area     density  high_density country
New York      19651127  141297  139.076746          True     USA
Illinois      12882135  149995   85.883763         False     USA
Florida       19552860  170312  114.806121          True     USA
California    38332521  423967   90.413926         False     USA
Texas         26448193  695662   38.018740         False     USA

In [102]:
df.sort_values(['high_density','population'])

            population    area     density  high_density country
Illinois      12882135  149995   85.883763         False     USA
Texas         26448193  695662   38.018740         False     USA
California    38332521  423967   90.413926         False     USA
Florida       19552860  170312  114.806121          True     USA
New York      19651127  141297  139.076746          True     USA

# pandas Summary
* Select rows using the ```df.loc[label]``` and ```df.iloc[loc]``` methods
* You can select columns by slicing ```df['colname']```, using the index directly as an attribute ```df.colnname```
* it is better to use ```df.loc[:,'colname']``` !
* For modifying use the ```df.loc[]``` or ```df.iloc[]``` attributes.
* For deleting rows/columns use the ```df.drop(index=i_labels, columns=c_labels)``` method.
* It's crutial to know which methods return a new DataFrame and which modify the original DataFrame.

<div class="alert alert-block alert-info"><b>Tip</b> use the `df.loc[]` or `df.iloc[]` attributes whenever possible </div>

# pandas Exercises

## 1. Slicing Rows of a DataFrame

In [108]:
df

            population    area     density  high_density country   vote
California    38332521  423967   90.413926         False     USA  Biden
Texas         26448193  695662   38.018740         False     USA  Biden
New York      19651127  141297  139.076746          True     USA  Biden
Florida       19552860  170312  114.806121          True     USA  Biden
Illinois      12882135  149995   85.883763         False     USA  Biden

1. Select the area in Florida
2. Select all rows where the density < 90
3. Select the population for high density states

In [109]:
df.loc['Florida','area']

170312

In [110]:
df.loc[df['density'] < 90]

          population    area    density  high_density country   vote
Texas       26448193  695662  38.018740         False     USA  Biden
Illinois    12882135  149995  85.883763         False     USA  Biden

In [111]:
df.loc[df['high_density'] ,'population']

New York    19651127
Florida     19552860
Name: population, dtype: int64

## 2. Adding Columns
* Add a columns where you place the outcome of the 2020 election (Florida and Texas voted for Trump, the other states for Biden)
* Add a new column that is 'a' for high_density states and `NaN` for all other

In [112]:
df.loc[: ,'vote'] = 'Biden'
df

            population    area     density  high_density country   vote
California    38332521  423967   90.413926         False     USA  Biden
Texas         26448193  695662   38.018740         False     USA  Biden
New York      19651127  141297  139.076746          True     USA  Biden
Florida       19552860  170312  114.806121          True     USA  Biden
Illinois      12882135  149995   85.883763         False     USA  Biden

In [113]:
df.loc[['Florida','Texas'] ,'vote'] = 'Trump'
df

            population    area     density  high_density country   vote
California    38332521  423967   90.413926         False     USA  Biden
Texas         26448193  695662   38.018740         False     USA  Trump
New York      19651127  141297  139.076746          True     USA  Biden
Florida       19552860  170312  114.806121          True     USA  Trump
Illinois      12882135  149995   85.883763         False     USA  Biden

In [114]:
df.loc[df['density'] > 90,'new']='a'
df

            population    area     density  high_density country   vote  new
California    38332521  423967   90.413926         False     USA  Biden    a
Texas         26448193  695662   38.018740         False     USA  Trump  NaN
New York      19651127  141297  139.076746          True     USA  Biden    a
Florida       19552860  170312  114.806121          True     USA  Trump    a
Illinois      12882135  149995   85.883763         False     USA  Biden  NaN

## 3. Create the following Dataframe and transpose it
Bonus set the `df.index` to the name column

In [117]:
raw_data = {"name": ['Bulbasaur', 'Charmander','Squirtle','Caterpie'],
            "type": ['grass', 'fire', 'water', 'bug'],
            "hp": [45, 39, 44, 45],
            }
df_pokemon = pd.DataFrame(raw_data)
df_pokemon

         name   type  hp
0   Bulbasaur  grass  45
1  Charmander   fire  39
2    Squirtle  water  44
3    Caterpie    bug  45

In [116]:
df_pokemon = df_pokemon.set_index('name')
df_pokemon.T

name Bulbasaur Charmander Squirtle Caterpie
type     grass       fire    water      bug
hp          45         39       44       45

In [118]:
df_pokemon.T

              0           1         2         3
name  Bulbasaur  Charmander  Squirtle  Caterpie
type      grass        fire     water       bug
hp           45          39        44        45